# Data cleansing

During the course of doing data analysis and modeling, a significant amount of time is spent on data preparation:

*   loading
*   cleaning
*   transforming
*   rearraging

Such tasks are often reported to take up 80% or more of an analystâ€™s time.

What can happen with the loading data are
* missing data
* duplicate data
* string manipulation
* other analytical data transformation

## Missing data
---

Some data are imperfect, but it is functional for lot of users

For numeric data,
  Pandas use Nan ``` Nan``` (Not a Number) to represent the number

So call a *sentinel value*

**To detect the missing data**

---


Check by `isNull` value

```python
import pandas as pd
import numpy as np
```



```python
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
```

In [1]:
import pandas as pd
import numpy as np

check for null value

```python
string_data.isnull()
```

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

The N/A handling method are provided in the data frame as given

![image-20230906053837943](./assets/image-20230906053837943.png)

### Filtering the data
---


The *NA* data can filtering out as shown

```python
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data
```

In [3]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

The `dropna` method will filter out the NA value

```python
data.dropna()
```

In [4]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

the data frame can be also filter

```python
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data
```

In [5]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

The `dropna` method will drop all the rows which contains NA value


```python
cleaned = data.dropna()
cleaned
```

In [6]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

**We** can drop only the line which contains **NA** all the rows usign `how='all'`

```python
data.dropna(how='all')
```

In [7]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

**To** drop only columns which contains  all NA, you can use the `axis=1 `parameter

In [8]:
axis=1

```python
data.dropna(how='all',axis=1)
```

In [9]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Try to add a new column with NA value
```python
data[4] = NA
data
```

In [10]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

drop na regarding to the axis
```python
data.dropna(axis=1, how='all')
```

In [11]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Comparing to
```python
data.dropna(axis=1)
```

In [12]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

What are differents of `how='all'` and no `how` parameter

We can drop the rows which may have more data than the given value as we can tolerate for some data missing. `tresh` parameter is required here
```python
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df
```

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.416076       NaN       NaN
1 -1.088949       NaN       NaN
2 -2.284696       NaN  0.277319
3  0.825749       NaN  1.005891
4  0.406335  2.433254 -0.079173
5 -1.281392 -0.394263  1.759293
6  1.688837  0.462137  0.349780

drop all NA
```python
df.dropna()
```

In [14]:
df.dropna()

          0         1         2
4  0.406335  2.433254 -0.079173
5 -1.281392 -0.394263  1.759293
6  1.688837  0.462137  0.349780

drop only a line which contains non-NA value more than or equal than the treshold
```python
df.dropna(thresh=2)
```

In [15]:
df.dropna(thresh=2)

          0         1         2
2 -2.284696       NaN  0.277319
3  0.825749       NaN  1.005891
4  0.406335  2.433254 -0.079173
5 -1.281392 -0.394263  1.759293
6  1.688837  0.462137  0.349780

#### Work



Form the file given in `file/property_data.csv`

Provide the given output

In [16]:
!pip install pandas

Requirement already satisfied: pandas in /Users/hathaichanokp./Note/venv/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /Users/hathaichanokp./Note/venv/lib/python3.12/site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/hathaichanokp./Note/venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/hathaichanokp./Note/venv/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Users/hathaichanokp./Note/venv/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Users/hathaichanokp./Note/venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.2.1 -> 24.2
[notice] To update, run: pip install --upgrade pip

In [17]:
import pandas as pd
file_path = 'file/property_data.csv'
df = pd.read_csv(file_path)
print(df.head())

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT  \
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600

     PRICE
0  20000.0
1      NaN
2      NaN
3      NaN
4      NaN

output 1

![image-20230906061553156](./assets/image-20230906061553156.png)

Output 2

![image-20230906061619935](./assets/image-20230906061619935.png)

Output 3

![image-20230906061652010](./assets/image-20230906061652010.png)

### Filling in missing data
---
Instead of filtering data. Default data may be used.
we can fil the default data for all `NA` values.

```python
df
```

```python
df.fillna(0)
```

Or we can define the value for each column
```python
df.fillna({"PID":0.5,"ST_NUM":1.2})
```

In [18]:
df.fillna({"PID":0.5,"ST_NUM":1.2})

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,1.2,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,0.5,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,1.2,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

`fillna` returns a new object, but we can modify the existing object in-place
```python
df.fillna(0,inplace=True)
df
```

In [19]:
df.fillna(0,inplace=True)
df

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,0.0
2,100003000.0,0.0,LEXINGTON,N,0,1,850,0.0
3,100004000.0,201.0,BERKELEY,12,1,0,700,0.0
4,0.0,203.0,BERKELEY,Y,3,2,1600,0.0
5,100006000.0,207.0,BERKELEY,Y,0,1,800,0.0
6,100007000.0,0.0,WASHINGTON,0,2,HURLEY,950,0.0
7,100008000.0,213.0,TREMONT,Y,1,1,0,0.0
8,100009000.0,215.0,TREMONT,Y,na,2,1800,0.0

We can use the interpolation method to file the value.

Now we create a new data frame with some `NA`
```python
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
```

In [20]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.141235 -1.566132  0.785206
1  0.523249  0.257157  0.542972
2  3.304435       NaN -0.834534
3 -1.004213       NaN -1.946358
4 -0.291906       NaN       NaN
5 -0.779984       NaN       NaN

Add the interpolation methods for more details google `dataframe fillna`
```python
df.fill()
```

In [21]:
df.fill()

AttributeError: 'DataFrame' object has no attribute 'fill'

we can set limit of filling data that it should not be filled more than limit value.
```python
df.ffill(limit=2)
```

In [22]:
df.ffill(limit=2)

          0         1         2
0 -0.141235 -1.566132  0.785206
1  0.523249  0.257157  0.542972
2  3.304435  0.257157 -0.834534
3 -1.004213  0.257157 -1.946358
4 -0.291906       NaN -1.946358
5 -0.779984       NaN -1.946358

Another fill method can be found in the api
such as `bfill` which is backward fill
```python
df.bfill()
```

In [24]:
df.bfill()

          0         1         2
0 -0.141235 -1.566132  0.785206
1  0.523249  0.257157  0.542972
2  3.304435       NaN -0.834534
3 -1.004213       NaN -1.946358
4 -0.291906       NaN       NaN
5 -0.779984       NaN       NaN


```python
df[6] = [1,2,3]
df
```

In [25]:
df[6] = [1,2,3]
df

ValueError: Length of values (3) does not match length of index (6)

#### Work

---
From the propery_data you have done from the last work
Provide this dataframe

Output 1
![image-20230906063035319](./assets/image-20230906063035319.png)

Output 2
![image-20230906063122466](./assets/image-20230906063122466.png)

Output 3
![image-20230906063412850](./assets/image-20230906063412850.png)

## Data Transformation

We need to transform the data in the format which can manipulate it later.

### Removing Duplicates


Some data duplication must be removed to reduce the unusual behaviour of data
from the provided data

setting up a new dataframe
```python
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data
```

In [26]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The duplicated data is found by

```python
data.duplicated()
```

In [27]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

So we can drop the duplicate code
```python
data.drop_duplicates()
```

In [28]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

we can select key to check the duplicate data, adding a new column to the data frame to see which data is stored
```python
data['v1'] = range(7)
data
```

In [29]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

now check for duplicatoin
```python
data.duplicated()
```

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

check the dupplicate key only the key in column k1
```python
data.duplicated(['k1'])
```

In [31]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

The previous work keep the first data in the result data frame. We can keep the last entry of the duplicate data using the `keep` parameter
comparing these code?
```python
data.drop_duplicates(['k1','k2'])
```

In [32]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

with
```python
data.drop_duplicates(['k1','k2'],keep='last')
```

In [33]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or mapping

Data can be mapped to a better representation

with the provided data frame
```python
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data
```

In [34]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

The mapping dictionary is provided
```python
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
```

In [35]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

Then we can provide the map as given
```python
lowercased = data['food'].str.lower()
lowercased
```

In [36]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

then mapping the data
```python
data['animal'] = lowercased.map(meat_to_animal)
data
```

In [37]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing value
---

Some value can be replaced, in order to manage the code easier.
For example with the given data frame
```python
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data
```

In [38]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

The value -999 may be the **sentinel** values

The sentinel value is the value which define the state of data but not the real data. For example, the exit point or the `NA` of the value.
```python
data.replace(-999, np.nan)
```

In [40]:
import numpy as np

In [41]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

we can replace multiple data with only one value

```python
data.replace([-999,-1000],np.nan)
```

In [42]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

Or replace different value with different data
```python
data.replace([-999,-1000],[np.nan,0])
```

In [43]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

or using the dictionary to map the request data
```python
data.replace({-999: np.nan, -1000: 0})
```

In [44]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Index

The axis index which we loaded from the different sources may be hard to understand.
So we rename the index name for the better understanding
```python
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data
```

In [45]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

We can use the function to change the name of each index
```python
transform = lambda x: x[:4].upper()
new_data_index = data.index.map(transform)
```

In [46]:
transform = lambda x: x[:4].upper()
new_data_index = data.index.map(transform)

To change the index name we have to set the index values
```python
data.index = new_data_index
data
```

In [47]:
data.index = new_data_index
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

Or if we want to rename it instancely (without seeing the new solution first)  we can use the `rename` method
```python
data.rename(index=str.title, columns=str.upper)
```

In [48]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

if we want to change the specific name, using the map for change the index name
```python
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})
```

In [49]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

To save the new name directly using `inplace` method
```python
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data
```

In [50]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

#### Work
---

From the previous work provide this output

Output1

fill PID, and PID as an index

![image-20230906065515528](./assets/image-20230906065515528.png)

Output2
Change the column name to your language

![image-20230906065658172](./assets/image-20230906065658172.png)

### Discretization and Bining
---

Extract data and put it in the bins for analysis

The bin is the range of the data that we want to analyze
create a list as
```python
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
```

In [51]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Then we create a bin
```python
bins = [18, 25, 35, 60, 100]
```

In [52]:
bins = [18, 25, 35, 60, 100]

Then we cut the data in to a bin, the cuts represent the bins for each data
```python
cuts = pd.cut(ages, bins)
cuts
```

In [53]:
cuts = pd.cut(ages, bins)
cuts

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

Instead of using the texts we can see the code (index) of each bins
```python
cuts.codes
```

In [54]:
cuts.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

and the catagories, and the amount of value in each cuts can be shown
```python
cuts.categories
```

In [55]:
cuts.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

We can count the amount of value in each cuts by using `value_counts` method
```python
pd.value_counts(cuts)
```

In [56]:
pd.value_counts(cuts)

/var/folders/q2/n7kvrhfn6pl7tqqhzw_fjwn40000gn/T/ipykernel_28911/170404824.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cuts)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

We can set the name of each cuts by passing the arrays of labels
```python
group_names = ['Youth', 'YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)
```

In [57]:
group_names = ['Youth', 'YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

If we pass the integer number instead of the bin edge, it will compute the equal-length bins based on the minimum and maximum values.
```python
data = np.random.rand(20)
pd.cut(data,4,precision=2)
```

In [58]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.54, 0.76], (0.089, 0.31], (0.54, 0.76], (0.089, 0.31], (0.31, 0.54], ..., (0.76, 0.98], (0.76, 0.98], (0.089, 0.31], (0.31, 0.54], (0.31, 0.54]]
Length: 20
Categories (4, interval[float64, right]): [(0.089, 0.31] < (0.31, 0.54] < (0.54, 0.76] < (0.76, 0.98]]

Try counting the value of data
```python
pd.value_counts(pd.cut(data,4,precision=2))
```

In [59]:
pd.value_counts(pd.cut(data,4,precision=2))

/var/folders/q2/n7kvrhfn6pl7tqqhzw_fjwn40000gn/T/ipykernel_28911/3211190142.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(pd.cut(data,4,precision=2))

(0.089, 0.31]    7
(0.31, 0.54]     6
(0.54, 0.76]     4
(0.76, 0.98]     3
Name: count, dtype: int64

### Detecting and Filtering Outliers
---


finding the outlining data and filter it out as it may be the error while gathering the data.
Let's start by having the given data
```python
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()
```

In [60]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.008485    -0.019835     0.010915     0.007534
std       0.999843     1.006119     0.996692     0.983801
min      -3.611698    -3.409521    -2.953139    -3.721929
25%      -0.641208    -0.692883    -0.648143    -0.624845
50%       0.000314    -0.000039     0.001857    -0.002518
75%       0.643665     0.702787     0.675864     0.616311
max       3.391784     2.396964     3.154701     3.146933

if we want to find the values in column 2 which the absolute value is exceeded 3
```python
col = data[2]
col[np.abs(col) >3]
```

In [61]:
col = data[2]
col[np.abs(col) >3]

589    3.086032
781    3.154701
Name: 2, dtype: float64

If we want to get rows which value is exceeding  3, we can use `any` methods
```python
data[(np.abs(data)>3).any(1)]
```

In [62]:
data[(np.abs(data)>3).any(1)]

TypeError: DataFrame.any() takes 1 positional argument but 2 were given

#### Work
---

From the given property file.
Categorize the size of the hourse as the small house (size is less than 800 sq,ft.),  the medium house (size is between 801-1200 sq.ft) and the large house ( size is more than 1200 sq.ft)

Show the number of each house size

You should ignore the value which is not the number value

# Data Wrangling: Join, Combine, Reshape

## Hierachical Indexing
---


Allow index to have multiple index levels on an axis

Use when working with higher dimensional data ina lower dimensional form


à¹ŠUse this setup configuration

In [63]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

create multiple index as given
```python
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data
```

In [64]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

We can see the index of the data
```python
data.index
```

In [65]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

we can see data in the multi level index to see only some index
```python
data['b']
```

In [66]:
data['b']

1   -0.555730
3    1.965781
dtype: float64

We can see data from the inner level
```python
data['b':'c']
```

In [67]:
data['b':'c']

b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
dtype: float64

The `loc` method can be used to select data from a particular group of rows and columns in the hierachical index
```python
data.loc[['b','d']]
```

In [68]:
data.loc[['b','d']]

b  1   -0.555730
   3    1.965781
d  2    0.281746
   3    0.769023
dtype: float64

We can see data from the inner level
```python
data.loc[:,2]
```

In [69]:
data.loc[:,2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

The slide can be also used
```python
data.loc[:,2]
```

In [70]:
data.loc[:,2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

Hierachical indexing play important role in reshaping data and group-based oepration.

The Hierachical index can be rearragen as the DataFrame using `unstack` methods
```python
data.unstack()
```

In [71]:
data.unstack()

          1         2         3
a -0.204708  0.478943 -0.519439
b -0.555730       NaN  1.965781
c  1.393406  0.092908       NaN
d       NaN  0.281746  0.769023

and the inverse version is `stack`
```python
data.unstack().stack()
```

In [72]:
data.unstack().stack()

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

As the data frame,  axis can have hierachical index
```python
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame
```

In [73]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

The Hierachy level can have names.
```python
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame
```

In [74]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### Work create this data frame

![image-20230907050812483](./assets/image-20230907050812483.png)

## Reordering and Sorting Levels
---

To transform data, we may have to swap the level of the data frame

The `swaplevel` method can be used to swap the level
```python
frame.swaplevel('key1','key2')
```

In [75]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

The index is not sort, so the multi hierachy is not set. we can sort the index at any level to set the better visualization
```python
frame.sort_index(level=1)
```

In [76]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

So swap the key and sort will make the hierarchy better
```python
frame.swaplevel(0,1).sort_index(level=0)
```

In [77]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

The `sort_index` method can be used to sort the index
```python
frame.swaplevel(0,1).sort_index(level=0)
```

In [78]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

## Summary Statistics by Level
---

The statistic data can be calculated with the specific level
For example, if we want to calculate on the rows data

We can calculate the sum of the data by the level
```python
frame.sum()
```

In [79]:
frame.sum()

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

then try
```python
frame.groupby(['key2']).sum()
```

In [80]:
frame.groupby(['key2']).sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

Or calculate on the column-wise
```python
frame.sum(axis=1)
```

In [81]:
frame.sum(axis=1)

key1  key2
a     1        3
      2       12
b     1       21
      2       30
dtype: int64

then try
```python
frame.groupby(['color'],axis=1).sum()
```

In [82]:
frame.groupby(['color'],axis=1).sum()

/var/folders/q2/n7kvrhfn6pl7tqqhzw_fjwn40000gn/T/ipykernel_28911/2111352784.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  frame.groupby(['color'],axis=1).sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## Indexing with DataFrame's Column


some time we want to use the row index as the columns
```python
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame
```

In [83]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

We can create a new data frame using some columns as index

```python
frame2 = frame.set_index(['c','d'])
frame2
```

In [84]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

By default, the column is removed from the source data frame. However, if we do not want to remove the column, the `drop` parameter is passed
```python
frame.set_index(['c','d'],drop = False)
```

In [85]:
frame.set_index(['c','d'],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

### Work



From the given [./file/car_details.xlsx](./file/car_details.xlsx)

provided the hierarchy data frame which carbrand, carmodel, and the model_name TH is a key indexes

Then try to find the average standard price for  each car brand, ignore the `NA` value